Revit 2024 API
RevitLinkUIUtils Class
 A class containing functions for displaying user interface related to Revit links.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static class RevitLinkUIUtils
Visual Basic
Public NotInheritable Class RevitLinkUIUtils
Visual C++
public ref class RevitLinkUIUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RevitLinkUIUtils
See Also
RevitLinkUIUtils Members
Autodesk.Revit.UI Namespace